final/app/controllers/evaluation_controller.rb

  def create
    @evaluation = Evaluation.create(comment: params[:comment])
---
INSERT INTO "evaluations" ("evaluator_id", "evaluated_id", "comment", "rating", "created_at", "updated_at", "lab_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["evaluator_id", 16], ["evaluated_id", 15], ["comment", "aaa"], ["rating", 1], ["created_at", "2021-12-14 22:34:54.111111"], ["updated_at", "2021-12-14 22:34:54.111111"], ["lab_id", 2]]