final/app/controllers/lab_controller.rb

  def index
    @labs = Lab.all
---
SELECT "labs".* FROM "labs"

  def show
    @lab = Lab.find(params[:id])
---
SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    Lab.create(lab_name: params[:lab_name])
---
INSERT INTO "labs" ("lab_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["lab_name", "Game of Set"], ["created_at", "2021-12-06 20:45:01.271090"], ["updated_at", "2021-12-06 20:45:01.271090"]]

  def destroy
    Lab.find(params[:id]).destroy
---
DELETE FROM "labs" WHERE "labs"."id" = ?  [["id", 1]]
SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]