final/app/controllers/roster_controller.rb

  def index
    @rosters = Roster.all
---
SELECT "rosters".* FROM "rosters"

  def create
    params[:student_ids].each do |student|
      Roster.create(team_id: params[:team_id], student_id: student)
---
INSERT INTO "rosters" ("team_id", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["team_id", 1], ["student_id", 4], ["created_at", "2021-12-06 17:41:55.299488"], ["updated_at", "2021-12-06 17:41:55.299488"]]