final/app/controllers/session_controller.rb

SELECT "students".* FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "buck1@gmail.com"], ["LIMIT", 1]]
---
  def create
    student = Student.find_by(email: params[:session][:email].downcase)