final/app/controllers/student_controller.rb

INSERT INTO "students" ("fname", "lname", "created_at", "updated_at", "is_admin", "email", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create

    @student = Student.new(student_params)
    if @student.save

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 20]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def destroy
    Student.find(params[:id]).destroy

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "students" SET "buckId" = ?, "updated_at" = ?, "email" = ?, "password_digest" = ? WHERE "students"."id" = ?  [["buckId", 123], ["updated_at", "2021-12-13 17:17:29.234491"], ["email", "123@123.com"], ["password_digest", "$2a$12$QSs7mzPu/1fTx533.DpOp.IuLyF1FMmbrDmZgY3paaKklbpJkCvEe"], ["id", 16]]
---
  def update
    @student = Student.find(params[:id])

    if @student.update(student_update)