final/app/controllers/team_controller.rb

  def create
    Team.create(tName: params[:tName])
---
INSERT INTO "teams" ("created_at", "updated_at", "tName") VALUES (?, ?, ?)  [["created_at", "2021-12-06 03:30:01.087077"], ["updated_at", "2021-12-06 03:30:01.087077"], ["tName", "AnimePps"]]

  def update
    @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    Team.find(params[:id]).destroy
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]