final/app/controllers/welcome_controller.rb

INSERT INTO "students" ("fname", "lname", "buckId", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["fname", "..."], ["lname", "..."], ["buckId", 0], ["created_at", "2021-12-06 00:05:39.336573"], ["updated_at", "2021-12-06 00:05:39.336573"]]
---
  def create
    @student = Student.new(fname: "...", lname: "...", buckId: "...")

    if @student.save