final/app/views/roster/index.html.erb

SELECT "rosters".* FROM "rosters"
SELECT "teams".* FROM "teams"
---
<table>
  <% @rosters = Roster.all %>
  <% @teams = Team.all %>

SELECT "students".* FROM "students" INNER JOIN "rosters" ON "students"."id" = "rosters"."student_id" WHERE "rosters"."team_id" = ?  [["team_id", 1]]
---
      </th>
        <% team.students.each do |student| %>