final/app/helpers/sessions_helper.rb

SELECT "students".* FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "buck1@gmail.com"], ["LIMIT", 1]]
---
    def set_current_student
        if session[:email]
            @current_student ||= Student.find_by(email: session[:email])