final/app/views/team/currentTeam.html.erb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<%team = Team.find(params[:id]) %>

SELECT "students".* FROM "students" INNER JOIN "rosters" ON "students"."id" = "rosters"."student_id" WHERE "rosters"."team_id" = ?  [["team_id", 1]]
---
<ul>
  <% team.students.each do |student| %>