final/app/views/team/index.html.erb

<table class="styled-table">
  <% @teams = Team.all %>
---
SELECT "teams".* FROM "teams"

  <% @teams.each do |team| %>
    <% if logged_in? && (@current_student.is_admin? || @current_student.teams.include?(team)) %>
---
SELECT 1 AS one FROM "teams" INNER JOIN "rosters" ON "teams"."id" = "rosters"."team_id" WHERE "rosters"."student_id" = ? AND "teams"."id" = ? LIMIT ?  [["student_id", 22], ["id", 2], ["LIMIT", 1]]
SELECT "teams".* FROM "teams"