final/app/views/team/index.html.erb

SELECT "teams".* FROM "teams"
---
<table>
  <% @teams = Team.all %>