final/app/views/welcome/stdView.html.erb

SELECT "students".* FROM "students"
---
<table>
  <% @students = Student.all %>