final/app/views/evaluation/assignedEval.html.erb

                <th>
                    <%team.students.each do |member|%>
---
SELECT "students".* FROM "students" INNER JOIN "rosters" ON "students"."id" = "rosters"."student_id" WHERE "rosters"."team_id" = ?  [["team_id", 4]]


                        <% if Evaluation.where(evaluator_id: @current_student.id,evaluated_id: member.id, lab_id: lab.lab_id).exists?%>
---
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT 1 AS one FROM "evaluations" WHERE "evaluations"."evaluator_id" = ? AND "evaluations"."evaluated_id" = ? AND "evaluations"."lab_id" = ? LIMIT ?  [["evaluator_id", 16], ["evaluated_id", 15], ["lab_id", 2], ["LIMIT", 1]]