final/app/views/evaluation/index.html.erb

SELECT "teams".* FROM "teams"
---
<br>
<% @teams = Team.all %>

SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
                <li>
                    Lab: <%= Lab.find(eval.lab_id).lab_name%> Score: <%= eval.rating%> Message: <%= eval.comment %> From: <%=Student.find(eval.evaluator_id).fname%>