final/app/views/evaluation/labEval.html.erb

    <p>Evaluator: <%=@current_student.fname%> <%=@current_student.lname%></p>
    <p>Evaluatee: <%=Student.find(@evaluatee).fname%> <%=Student.find(@evaluatee).lname%></p>
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]