final/app/views/evaluation/newEval.html.erb

  <div>
    <% @students = Student.all %>
---
SELECT "students".* FROM "students"