final/app/views/team_labs/index.html.erb

<table class = "styled-table">
  <% @teams = Team.all %>
---
SELECT "teams".* FROM "teams"

      </th>
        <% team.labs.each do |lab| %>
---
SELECT "labs".* FROM "labs" INNER JOIN "team_labs" ON "labs"."id" = "team_labs"."lab_id" WHERE "team_labs"."team_id" = ?  [["team_id", 2]]