final/app/views/team_labs/newTeamLab.html.erb

  <%=  form_with model: @teamLab do |form| %>
  <% @teams = Team.all %>
---
SELECT "teams".* FROM "teams"

  <br>
  <% @labs = Lab.all %>
---
SELECT "labs".* FROM "labs"