final/app/views/lab/currentLab.html.erb

<% lab = Lab.find(params[:id]) %>
<h1>Lab <%= lab.lab_name %></h1>
<% students = Student.all %>
---
SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students"

  <% students.each do |student| %>
  <% if lab.evaluations.any? { |eval| eval.evaluator_id != student.id }%>
---
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."lab_id" = ?  [["lab_id", 2]]