final/app/views/lab/index.html.erb

SELECT "labs".* FROM "labs"
---
<table class = "styled-table">
  <% @labs = Lab.all %>