final/app/views/lab/index.html.erb

SELECT "labs".* FROM "labs"
---
<table>
  <% @labs = Lab.all %>