final/app/views/student/currentStd.html.erb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<table>
    <%student = Student.find(params[:id])%>