final/app/views/student/currentStd.html.erb

<div class="card">
    <%student = Student.find(params[:id])%>
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]