final/app/views/student/stdView.html.erb

<h1>All Current Students</h1>
<% @students = Student.all %>
---
SELECT "students".* FROM "students"